# num_1 = 5
# num_2 = 6
# print(num_1+num_2)

# განსხვავება მათ შორის
# print("giorgi")
# print(lasha)
# interpreted ჯერ გამოიტანს გიორგის და შემდეგ კი გვაჩვენებს სინტაქსურ ერორს
# compiled აღარ გამოიანს გიორგის და პირდაპირ გამოიტანს სინტაქსურ ერორს
# compiler არ მოყვება ბრძანებებს რიგ რიგობით ჯერ ის მთლიანად ტარგმნის დაწერილ კოდებს შემდეგ კი აძლევს კომპიუტერს 
# interpreted რიგ რიგობით მიყვება და მასე განაგრძობს კოდის გამოტანას და როდესაც ის შეცდომას ნახავს იგი გაჩერდება და მუშაობას შეწყვეტს
num_1 = input("enter your age: ")
print(int(input(num_1)))

